In [1]:
import numpy as np
import pandas as pd
from datetime import datetime

In [5]:
myyear=2015
mymonth=6
myday=7
myhour=8
mymin=17
mysec=45

In [6]:
mydate = datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [7]:
mydate

datetime.datetime(2015, 6, 7, 8, 17, 45)

In [8]:
mydate.min

datetime.datetime(1, 1, 1, 0, 0)

In [9]:
mydate.year

2015

In [13]:
myser = pd.Series( ['Nov3, 1990','2001-01-01',None])

In [14]:
myser

0    Nov3, 1990
1    2001-01-01
2          None
dtype: object

In [15]:
pd.to_datetime(myser)

0   1990-11-03
1   2001-01-01
2          NaT
dtype: datetime64[ns]

In [17]:
obvi_euro_date = '31-12-2001'

In [18]:
pd.to_datetime(obvi_euro_date)

Timestamp('2001-12-31 00:00:00')

In [19]:
euro_date='10-12-2000'

In [20]:
pd.to_datetime(euro_date)

Timestamp('2000-10-12 00:00:00')

In [21]:
pd.to_datetime(euro_date,dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [22]:
style_date='06--Dec--2001'

In [25]:
pd.to_datetime(style_date,format='%d--%b--%Y')

Timestamp('2001-12-06 00:00:00')

In [26]:
cd ..

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass

In [27]:
cd Notes/

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\Notes

In [28]:
cd 03-Pandas/

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\Notes\03-Pandas

In [29]:
pwd

'G:\\Mes Documents\\Documents\\Python\\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\\Notes\\03-Pandas'

In [30]:
filepath = 'G:\\Mes Documents\\Documents\\Python\\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\\Notes\\03-Pandas'

In [31]:
cd ..

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\Notes

In [32]:
cd ..

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass

In [33]:
cd Section05-Pandas/

G:\Mes Documents\Documents\Python\Udemy-Python-for-Machine-Learning-and-Data-Science-Masterclass\Section05-Pandas

In [35]:
sales = pd.read_csv(filepath+'\\RetailSales_BeerWineLiquor.csv')

In [37]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [39]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [40]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [41]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [42]:
sales['DATE'][0].year

1992

In [43]:
sales = pd.read_csv(filepath+'\\RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [44]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [45]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [46]:
sales.set_index('DATE')

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]